# Pandas Data Ingestion & Inspection

### Review of Pandas Dataframes

Get Data in and review
- Pandas is library for data analysis
- dataframe, tabular data structure with rows and columns
- Timeseries for date/time index
- df.iloc[:5, :]
- df.iloc[:-5, :]   fifth last row using negative
- df.head(10) - first 10 rows
- df.tail() - last 5 rows
- df.info - summary information.  Type of Index, Columns and Dtypes
- Broadcasting
- extract single column df['column'] returns a Series
- df.values - on a single column returns a Numpy Array of values

Panda Series - 1D Labelled NumPy array
DataFrame is a 2D labelled array whose columns are Series

In [3]:
import pandas as pd
import numpy as np

In [5]:
# Assigning scalar value to column slice broadcasts value to each row
# Assign NaN to every third element
# every third row, assign NaN to the Last Column

AAPL.iloc[::3, -1] = np.nan

NameError: name 'AAPL' is not defined

In [6]:
low = AAPL['low']

# type returns Series
type(low)

low.head()

# extract numerical entries and form a Numpy Array
lows = low.values

# type returns Numpy Array
type(lows)

NameError: name 'AAPL' is not defined

#### NumPy and pandas working together

Pandas depends upon and interoperates with NumPy, the Python library for fast numeric array computations. For example, you can use the DataFrame attribute .values to represent a DataFrame df as a NumPy array. You can also pass pandas data structures to NumPy methods. In this exercise, we have imported pandas as pd and loaded world population data every 10 years since 1960 into the DataFrame df. This dataset was derived from the one used in the previous exercise.

Your job is to extract the values and store them in an array using the attribute .values. You'll then use those values as input into the NumPy np.log10() method to compute the base 10 logarithm of the population values. Finally, you will pass the entire pandas DataFrame into the same NumPy np.log10() method and compare the results.

In [7]:
# Creating df from scratch

data_dict = {'Year':[1960, 1970, 1980, 1990, 2000, 2010],
           'Total Population':[3.034971, 3.684823, 4.436590, 5.282716, 6.115974, 6.924283]}

df = pd.DataFrame(data_dict)

In [8]:
# Import numpy
import numpy as np

# Create array of DataFrame values: np_vals
np_vals = df.values

# Create new array of base 10 logarithm values: np_vals_log10
np_vals_log10 = np.log10(np_vals)

# Create array of new DataFrame by passing df to np.log10(): df_log10
df_log10 = np.log10(df)

# Print original and new data containers
[print(x, 'has type', type(eval(x))) for x in ['np_vals', 'np_vals_log10', 'df', 'df_log10']]

np_vals has type <class 'numpy.ndarray'>
np_vals_log10 has type <class 'numpy.ndarray'>
df has type <class 'pandas.core.frame.DataFrame'>
df_log10 has type <class 'pandas.core.frame.DataFrame'>

[None, None, None, None]

Wonderful work! As a data scientist, you'll frequently interact with NumPy arrays, pandas Series, and pandas DataFrames, and you'll leverage a variety of NumPy and pandas methods to perform your desired computations. Understanding how NumPy and pandas work together will prove to be very useful.

# Building Dataframes from Scratch

- pd.read_csv('file', index_col=0)
- create df from Dictionaries
- create df from Lists
- Broadcasting - technique for Numpy and Pandas
    - use to broadcast new columns
    - saves tim in generating long lists, arrays, or columns without loops
    - number, strings
- rename Index - df.index = ['index names']
- rename columns - df.columns = ['col names']

In [9]:

data_dict = {'Year':[1960, 1970, 1980, 1990, 2000, 2010],
           'Total Population':[3.034971, 3.684823, 4.436590, 5.282716, 6.115974, 6.924283]}

df = pd.DataFrame(data_dict)

#### Zip lists to build a DataFrame

In this exercise, you're going to make a pandas DataFrame of the top three countries to win gold medals since 1896 by first building a dictionary. list_keys contains the column names 'Country' and 'Total'. list_values contains the full names of each country and the number of gold medals awarded. The values have been taken from Wikipedia.

Your job is to use these lists to construct a list of tuples, use the list of tuples to construct a dictionary, and then use that dictionary to construct a DataFrame. In doing so, you'll make use of the list(), zip(), dict() and pd.DataFrame() functions. Pandas has already been imported as pd.

Note: The zip() function in Python 3 and above returns a special zip object, which is essentially a generator. To convert this zip object into a list, you'll need to use list(). You can learn more about the zip() function as well as generators in Python Data Science Toolbox (Part 2)

In [55]:
list_keys = ['Country', 'Total']

list_values = [['United States', 'Soviet Union', 'United Kingdom'], [1118, 473, 273]]

In [56]:
# list of tuples using zip

zipped = list(zip(list_keys, list_values))

In [57]:
# construct a dictionary using dict()

data = dict(zipped)

In [58]:
df_countries = pd.DataFrame(data)

In [59]:
df_countries

          Country  Total
0   United States   1118
1    Soviet Union    473
2  United Kingdom    273

In [10]:
# Building Dataframes from lists

cities = ['Austin', 'Dallas', 'Austin', 'Dallas']
signups = [7, 12, 3, 5]
visitors = [139, 237, 326, 456]
weekdays = ['Sun', 'Sun', 'Mon', 'Mon']

list_labels = ['city', 'signups', 'visitors', 'weekday']
list_cols = [cities, signups, visitors, weekdays]

In [11]:
# notice list_cols is a list of lists

list_cols

[['Austin', 'Dallas', 'Austin', 'Dallas'],
 [7, 12, 3, 5],
 [139, 237, 326, 456],
 ['Sun', 'Sun', 'Mon', 'Mon']]

In [12]:
# Python List and Zip functions
# creates a List of Tuples

zipped = list(zip(list_labels, list_cols))

In [13]:
print(zipped)

[('city', ['Austin', 'Dallas', 'Austin', 'Dallas']), ('signups', [7, 12, 3, 5]), ('visitors', [139, 237, 326, 456]), ('weekday', ['Sun', 'Sun', 'Mon', 'Mon'])]

In [14]:
data = dict(zipped)

users = pd.DataFrame(data)

In [15]:
users

     city  signups  visitors weekday
0  Austin        7       139     Sun
1  Dallas       12       237     Sun
2  Austin        3       326     Mon
3  Dallas        5       456     Mon

#### Building DataFrames with broadcasting

You can implicitly use 'broadcasting', a feature of NumPy, when creating pandas DataFrames. In this exercise, you're going to create a DataFrame of cities in Pennsylvania that contains the city name in one column and the state name in the second. We have imported the names of 15 cities as the list cities

In [31]:
cities = ['Manheim',
 'Preston park',
 'Biglerville',
 'Indiana',
 'Curwensville',
 'Crown',
 'Harveys lake',
 'Mineral springs',
 'Cassville',
 'Hannastown',
 'Saltsburg',
 'Tunkhannock',
 'Pittsburgh',
 'Lemasters',
 'Great bend']

In [32]:
# state = ['PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA']
state = 'PA'
data = {'state':state, 'city':cities}

In [33]:
df_cities = pd.DataFrame(data)

In [34]:
df_cities

               city state
0           Manheim    PA
1      Preston park    PA
2       Biglerville    PA
3           Indiana    PA
4      Curwensville    PA
5             Crown    PA
6      Harveys lake    PA
7   Mineral springs    PA
8         Cassville    PA
9        Hannastown    PA
10        Saltsburg    PA
11      Tunkhannock    PA
12       Pittsburgh    PA
13        Lemasters    PA
14       Great bend    PA

In [35]:
#### Broadcasting - new cols built on the fly

users['fees'] = 0

In [36]:
users

     city  signups  visitors weekday  fees
0  Austin        7       139     Sun     0
1  Dallas       12       237     Sun     0
2  Austin        3       326     Mon     0
3  Dallas        5       456     Mon     0

#### Labeling your data

You can use the DataFrame attribute df.columns to view and assign new string labels to columns in a pandas DataFrame.

In [18]:
# rename columns

df.columns = ['new1', 'new2']

df

       new1  new2
0  3.034971  1960
1  3.684823  1970
2  4.436590  1980
3  5.282716  1990
4  6.115974  2000
5  6.924283  2010

In [19]:
# resetting Index

df.index = ['a', 'b', 'c', 'd', 'e', 'f']

df

       new1  new2
a  3.034971  1960
b  3.684823  1970
c  4.436590  1980
d  5.282716  1990
e  6.115974  2000
f  6.924283  2010

# Importing & Exporting Data

reading data from files.  Sunspot data from SILSO.

Problems with this file that require 'Tidying'
- CSV file has no column headers
    - Columns 0-2: Gregorian date (Year, Month, Day) 
    - Column 3: Date as fraction as year
    - Column 4: Daily Total Sunspot Number
    - Column 5: Definitive/provisional indicator(1 or 0)
- Missing value sin Column 4 indicated by -1 USE NA_VALUES = '-1'
- Dates representation inconvenient - awkward for computation USE PARSE DATES


From SILSO:
Contents:
Column 1-3: Gregorian calendar date
- Year
- Month
- Day
- Column 4: Date in fraction of year. USE PARSE_DATES
- Column 5: Daily total sunspot number. A value of -1 indicates that no number is available for that day (missing value). USE NA_VALUES
- Column 6: Daily standard deviation of the input sunspot numbers from individual stations.
- Column 7: Number of observations used to compute the daily value.
- Column 8: Definitive/provisional indicator. '1' indicates that the value is definitive. '0' indicates that the value is still provisional.

In [89]:
col_names = ['year', 'month', 
             'dec_date', 'sunspots', 'std_dev',
             'observations', 'definite']

In [118]:
import pandas as pd

filepath = './data/SN_ms_tot_V2.0.csv'

# na_values of various -1 = NaN because csv file shows blank spaces
sunspots = pd.read_csv(filepath, sep=';', header=None,
                       names=col_names,
                       na_values=['-1', ' -1', '   -1', '   -1'],
                       parse_dates=[[0,1]])

In [121]:
# Note datetime64 - which is good for timeseries

sunspots.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3241 entries, 0 to 3240
Data columns (total 6 columns):
year_month      3241 non-null datetime64[ns]
dec_date        3241 non-null float64
sunspots        3229 non-null float64
std_dev         2401 non-null float64
observations    2413 non-null float64
definite        3241 non-null int64
dtypes: datetime64[ns](1), float64(4), int64(1)
memory usage: 152.0 KB

In [120]:
sunspots.iloc[10:20, :]

   year_month  dec_date  sunspots  std_dev  observations  definite
10 1749-11-01  1749.874     146.4      NaN           NaN         1
11 1749-12-01  1749.958     147.9      NaN           NaN         1
12 1750-01-01  1750.042     148.4      NaN           NaN         1
13 1750-02-01  1750.123     150.3      NaN           NaN         1
14 1750-03-01  1750.204     153.9      NaN           NaN         1
15 1750-04-01  1750.288     154.3      NaN           NaN         1
16 1750-05-01  1750.371     147.0      NaN           NaN         1
17 1750-06-01  1750.455     139.7      NaN           NaN         1
18 1750-07-01  1750.538     138.8      NaN           NaN         1
19 1750-08-01  1750.623     136.3      NaN           NaN         1

In [126]:
# stores date as index

sunspots.index = sunspots['year_month']

# rename index with more concise label
sunspots.index.name = 'date'

In [127]:
# trim redundant columns like year_month and dec_date

cols = ['sunspots', 'definite']

sunspots = sunspots[cols]

In [130]:
# results are a more compactful dataframe with meaningful data

sunspots.iloc[10:20, :]

            sunspots  definite
date
1749-11-01     146.4         1
1749-12-01     147.9         1
1750-01-01     148.4         1
1750-02-01     150.3         1
1750-03-01     153.9         1
1750-04-01     154.3         1
1750-05-01     147.0         1
1750-06-01     139.7         1
1750-07-01     138.8         1
1750-08-01     136.3         1

#### writing files .to_csv() method

these have a host of options for fine tuning the behavior

In [134]:
# write to csv
out_csv = './data/sunsports.csv'
sunspots.to_csv(out_csv)

# write to tab separated file
out_tsv = './data/sunspots.tsv'
sunspots.to_csv(out_tsv, sep='\t')

# write to xlsx
out_xlsx = './data/sunspots.xlsx'
sunspots.to_excel(out_xlsx)